const complaints = [
   {
    id: 1,
    title: "ประกาศขายบ้านข้อมูลไม่ตรงกับความเป็นจริง",
    details:
      "ติดต่อผู้ขายผ่านประกาศ “ขายบ้านเดี่ยว 2 ชั้น ย่านลาดพร้าว” แต่ขนาดและจำนวนห้องไม่ตรงกับที่ระบุในเว็บ",
    request:
      "ตรวจสอบประกาศและดำเนินการเตือนหรือระงับบัญชีผู้ขาย",
    reporter: "Natcha Prasert",
  },
  {
    id: 2,
    title: "ผู้ขายไม่มาตามนัดหมายดูคอนโด",
    details:
      "นัดหมายผู้ขายเพื่อดูคอนโดสุขุมวิท แต่ผู้ขายไม่มาตามนัดและไม่ตอบข้อความ",
    request:
      "ตรวจสอบพฤติกรรมผู้ขายและพิจารณาเตือนหรือระงับบัญชี",
    reporter: "Krit Phanuphong",
  },
  {
    id: 3,
    title: "ติดต่อไม่ได้",
    details:
      "พยายามทักผู้ขายหลายครั้ง แต่ผู้ขายไม่ตอบกลับข้อความหรือโทรศัพท์",
    request: "ตรวจสอบพฤติกรรมผู้ขายรายนี้",
    reporter: "Sirintra Chaiyawan",
  }
];
export function fetchComplaints() {
  return complaints;
}
