const complaints = [
  {
    id: 1,
    title: "ประกาศขายบ้านข้อมูลไม่ตรงกับความเป็นจริง",
    details:
      "ดิฉันได้ติดต่อผู้ขายผ่านประกาศ “ขายบ้านเดี่ยว 2 ชั้น ย่านลาดพร้าว” แต่เมื่อไปดูสถานที่จริง พบว่าขนาดพื้นที่ใช้สอยและจำนวนห้องนอนไม่ตรงกับที่ระบุไว้ในหน้าเว็บ อีกทั้งรูปภาพในประกาศดูเหมือนจะไม่ใช่ของบ้านหลังดังกล่าว",
    request:
      "ขอให้แอดมินตรวจสอบประกาศนี้และดำเนินการเตือนหรือระงับบัญชีผู้ขาย หากพบว่ามีการให้ข้อมูลเท็จ",
  },
  {
    id: 2,
    title: "ผู้ขายไม่มาตามนัดหมายดูคอนโด",
    details:
      "ดิฉันได้นัดหมายกับผู้ขายเพื่อดูคอนโดที่สุขุมวิท ในวันที่ 8 พฤศจิกายน เวลา 14.00 น. แต่ผู้ขายไม่มาตามนัดและไม่ตอบกลับข้อความหรือโทรศัพท์เลย ทำให้เสียเวลาและค่าเดินทาง",
    request:
      "ขอให้ทีมงานตรวจสอบพฤติกรรมของผู้ขายรายนี้ และพิจารณาเตือนหรือระงับบัญชีเพื่อป้องกันไม่ให้เกิดเหตุการณ์ซ้ำ",
  },
  {
    id: 3,
    title: "ติดต่อไม่ได้",
    details:
      "ดิฉันพยายามทักไปหาผู้ขายแล้ว แต่ผู้ขายไม่ตอบกลับข้อความหรือโทรศัพท์เลย",
    request: "ขอให้ทีมงานตรวจสอบพฤติกรรมของผู้ขายรายนี้",
  }
];
export function fetchComplaints() {
  return complaints;
}
